package wan;

/**
 * Created by 18435 on 2017/10/25.
 * 规则说明:
 * 纵横填字网格提供给你，连同一组字(或地名的名称)，需要填入网格。
 * 网格中的单元格最初也是+标志或-标志。
 * 标记为一种的单元格+必须像他们现在那样离开。标记为一种的单元格-需要用适当的字符填充。
 */
public class YouXiOne {

    /**
     * 输入 :
       +-++++++++
       +-++++++++
       +-++++++++
       +-----++++
       +-+++-++++
       +-+++-++++
       +++++-++++
       ++------++
       +++++-++++
       +++++-++++
       LONDON;DELHI;ICELAND;ANKARA
       输出:
       +L++++++++
       +O++++++++
       +N++++++++
       +DELHI++++
       +O+++C++++
       +N+++E++++
       +++++L++++
       ++ANKARA++
       +++++N++++
       +++++D++++
     */
}
